ardonplay.vscode-jetbrains-full-icon-theme
bam.vscode-perforce
batisteo.vscode-django
bungcip.better-toml
charliermarsh.ruff
donjayamanne.python-environment-manager
donjayamanne.python-extension-pack
eamodio.gitlens
k--kato.intellij-idea-keybindings
kevinrose.vsc-python-indent
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-vscode-remote.remote-wsl
ms-vscode.powershell
njpwerner.autodocstring
njqdev.vscode-python-typehint
redhat.vscode-yaml
tamasfe.even-better-toml
tht13.python
tushortz.python-extended-snippets
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
wayou.vscode-todo-highlight
wholroyd.jinja
